```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mishra-tf-cloud-demo/terraform-github-actions-github-satellite-demo/runs/run-kML71XBbFhJshJRg

Waiting for the plan to start...

Terraform v0.12.24
Configuring remote state backend...
Initializing Terraform configuration...
2020/04/29 01:51:23 [DEBUG] Using modified User-Agent: Terraform/0.12.24 TFC/9f8aafed89
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

cloudflare_record.root_www: Refreshing state... [id=480a93e9eecc8771e4d45d1dcfd4b64e]
cloudflare_record.root: Refreshing state... [id=dbf98a5b1667ee43cb05891536df9537]
data.aws_iam_policy_document.bucket_policy: Refreshing state...
aws_s3_bucket.website_subdomain: Refreshing state... [id=buycoffee.app]
aws_s3_bucket.website_www: Refreshing state... [id=www.buycoffee.app]
aws_s3_bucket_object.website_example: Refreshing state... [id=index.html]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket_object.website_error will be created
  + resource "aws_s3_bucket_object" "website_error" {
      + acl                    = "private"
      + bucket                 = "www.buycoffee.app"
      + content_type           = "text/html"
      + etag                   = "368cdcba86df5b12db6f90f8b378dc7a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "error.html"
      + server_side_encryption = (known after apply)
      + source                 = "error.html"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Resources: 0 of 2 estimated
           $0.0/mo +$0.0
```